package qr;
//Напишите программу, которая находит сумму всех чисел от 1 до 100.
public class code3 {
    public static void main(String[] args) {
        int sum=0;

        for (int i =0 ; i <=100;i++){
            sum += i;

        } System.out.println(sum);


    }
}
