package qr;
//Напишите программу, которая выводит на экран числа от 1 до 10.
public class code4 {
    public static void main(String[] args) {
        for (int i = 1; i<=10;i++){
            System.out.println(i);
        }
    }
}
